README.org
#+TITLE: Ángel Emacs
#+AUTHOR: Nicolas Ortega
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
#+LANGUAGE: ES
#+STARTUP: showeverything

* Tabla de Contenidos                                                   :TOC:
- [[#prefacio][Prefacio]]
- [[#arreglar-customorg][Arreglar custom.org]]
- [[#eliminar-archivos-temporales][Eliminar archivos temporales]]
- [[#simplificar-yesno][Simplificar "yes/no"]]
- [[#tecla-de-escape][Tecla de escape]]
- [[#configuración-visual-basica][Configuración Visual Basica]]
- [[#administrador-de-paquetes---straightel][Administrador de Paquetes - straight.el]]
- [[#letras][Letras]]
- [[#lenguajes-de-babel][Lenguajes de Babel]]
- [[#corrección][Corrección]]
- [[#teclas][Teclas]]
- [[#alegría-visual][Alegría Visual]]
  - [[#iconos-linea-de-modos-y-temas][Iconos, Linea de Modos y Temas]]
  - [[#emojis][Emojis]]
  - [[#tablero][Tablero]]
- [[#escritura][Escritura]]
- [[#navegación-con-ivy--counsel][Navegación con Ivy & Counsel]]
- [[#simulador-de-vim][Simulador de Vim]]
- [[#hydra][Hydra]]
- [[#manejo-de-proyectos][Manejo de Proyectos]]
- [[#magit][Magit]]
- [[#dired][Dired]]
- [[#treemacs][Treemacs]]
- [[#org][Org]]
  - [[#modos-de-org][Modos de Org]]
  - [[#paquete-org][Paquete Org]]
  - [[#org-toc][Org TOC]]
  - [[#org-modern][Org Modern]]
  - [[#org-fancy-priorities][Org Fancy Priorities]]
  - [[#atajos-de-bloque][Atajos de Bloque]]
  - [[#agenda-todos][Agenda TODOs]]
  - [[#org-hábitos][Org Hábitos]]
  - [[#org-notas-rápidas][Org Notas Rápidas]]
  - [[#org-ajustes-visuales][Org Ajustes Visuales]]
  - [[#org-babel-tangle][Org Babel Tangle]]
- [[#corfu][Corfu]]
- [[#servidores-de-lenguajes--lista-de-sugestiones][Servidores de Lenguajes & Lista de Sugestiones]]
  - [[#orderless][Orderless]]
  - [[#lsp-mode][LSP-Mode]]
  - [[#yasnippet][Yasnippet]]
  - [[#mejoras-de-rendimiento-para-lsp][Mejoras de Rendimiento para LSP]]
- [[#lenguages][Lenguages]]
  - [[#typescript][Typescript]]
  - [[#python][Python]]
- [[#atajos][Atajos]]

* Prefacio
Esta es mi configuración personal de Emacs para uso diario, ya sea para programar o para escribir.

* Arreglar custom.org
#+begin_src emacs-lisp
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)
#+end_src

* Eliminar archivos temporales
#+begin_src emacs-lisp
(setq make-backup-files nil)
(setq auto-save-default nil)
#+end_src

* Simplificar "yes/no"
#+begin_src emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

* Tecla de escape
#+begin_src emacs-lisp
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

* Configuración Visual Basica
#+begin_src emacs-lisp

  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)  ; Disable visible scrollbar
  (tool-bar-mode -1)    ; Disable the toolbar
  (tooltip-mode -1)     ; Disable tooltips
  (set-fringe-mode 10)  ; Give some breathing room

  (menu-bar-mode -1)    ; Disable the menu bar

  (setq visible-bell t) ; Set up the visible bell

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  markdown-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (column-number-mode)
  (global-display-line-numbers-mode t)
  (setq display-line-numbers-type 'relative)
#+end_src

* Administrador de Paquetes - straight.el
Tanto "use-package" como "org" son requeridos justo después de inicializar straight.el para prevenir problemas al iniciar Emacs.
#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
         (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package)
  (straight-use-package 'org)


  (setq straight-use-package-by-default t)
#+end_src

* Letras
#+begin_src emacs-lisp
  (use-package mixed-pitch
    :hook
    (text-mode . mixed-pitch-mode))

  (defvar angl/default-font-size 125)
  (set-face-attribute 'default nil :font "Iosevka" :height angl/default-font-size)
  (set-face-attribute 'fixed-pitch nil :font "Iosevka" :height angl/default-font-size)
  (set-face-attribute 'variable-pitch nil :font "Iosevka Comfy Duo" :height angl/default-font-size :weight 'regular)
#+end_src

* Lenguajes de Babel
#+begin_src emacs-lisp
  (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)))
#+end_src
* Corrección
#+begin_src emacs-lisp
      (dolist (hook '(text-mode-hook))
        (add-hook hook (lambda () (flyspell-mode 1))))
      (setq ispell-program-name "hunspell")
      (setq ispell-dictionary "es_AR")

  (use-package flyspell-correct
      :after flyspell
      :bind (:map flyspell-mode-map ("C-;" . flyspell-correct-wrapper)))

    (use-package flyspell-correct-ivy
      :after flyspell-correct)
#+end_src

* Teclas
#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.2))

  (use-package helpful
    :straight t
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

  (use-package general
    :after evil
    :config
    (general-create-definer angl/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")
    (angl/leader-keys
      "v" '(:ignore t :which-key "toggles")
      "vt" '(counsel-load-theme :which-key "choose theme")))
  (general-define-key
   "C-M-j" 'counsel-switch-buffer)
#+end_src

* Alegría Visual
** Iconos, Linea de Modos y Temas
Siempre usa "11" para el tamaño de fuente al tomar capturas de pantalla.
#+begin_src emacs-lisp
  (use-package all-the-icons
    :straight t
    :if (display-graphic-p))

  (use-package doom-themes)

  (use-package solaire-mode)
  (solaire-global-mode +1)

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

  (use-package doom-modeline
    :straight t
    :hook (after-init . doom-modeline-mode)
    :custom ((doom-modeline-height 35)))

  (straight-use-package
   '(screenshot :type git :host github :repo "tecosaur/screenshot"))

  (load-theme 'doom-solarized-light :no-confirm)
    #+end_src

** Emojis
#+begin_src emacs-lisp
  (use-package emojify
    :hook (after-init . global-emojify-mode))
  (add-hook 'after-init-hook #'global-emojify-mode)
#+end_src

** Tablero
#+begin_src emacs-lisp
  (use-package dashboard
    :straight t
    :init
    (progn
       (setq dashboard-center-content t)
       (setq dashboard-startup-banner "~/Pictures/angel-wings.png")
       (setq dashboard-set-file-icons t)
       (setq dashboard-banner-logo-title "PAX VOBISCUM")
       (setq dashboard-set-heading-icon t))
    :config
    (dashboard-setup-startup-hook))
    (setq dashboard-items '((recents  . 3)
                                 (projects . 3)
                                 (agenda . 3)))
(setq dashboard-footer-messages '("Α Β Ρ Α Κ Α Δ Η Β Ρ Α"))
(setq dashboard-footer-icon (all-the-icons-wicon "sunrise"
                                                   :height 1.1
                                                   :v-adjust -0.05
                                                   :face 'font-lock-keyword-face))
#+end_src

* Escritura
#+begin_src emacs-lisp
  (use-package writeroom-mode)
#+end_src

* Navegación con Ivy & Counsel
#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-buffer-history))
    :config
    (setq ivy-initial-inputs-alist nil))
  (use-package ivy-rich
  :init
  (ivy-rich-mode 1))
#+end_src

* Simulador de Vim
#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
#+end_src

