README.org
* Hydra
Tengo que configurar Hydra para Git Actions
#+begin_src emacs-lisp
(use-package hydra
  :defer t)

(defhydra hydra-text-scale (:timeout 1)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(angl/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))
#+end_src

* Manejo de Proyectos
#+begin_src emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Programing")
    (setq projectile-project-search-path '("~/Programing")))
  (setq projectile-switch-project-action #'project-dired))

;; TODO projectile integration with ivy for my projectes using counsel-projectile
;; Do so with C-c p E and set variables like "projectile-project-run-cmd" => spago run or smth
;; Maybe you can set it to complie dwm when editing files in .loca/src/*
;; Load then with M-: (hack-dir-local-variables) inside the project dir (and restart-buffer)

(use-package counsel-projectile
  :config (counsel-projectile-mode))
#+end_src

* Magit
#+begin_src emacs-lisp
(use-package magit
  :commands magit-status
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  :bind (:map magit-status-mode-map
              ("c" . magit-commit-create)))
#+end_src

* Dired
#+begin_src emacs-lisp
  (use-package dired
    :straight nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))

  (use-package dired-single
    :commands (dired dired-jump))

  (use-package all-the-icons-dired
    :if (display-graphic-p)
    :hook (dired-mode . all-the-icons-dired-mode)
    :config (setq all-the-icons-dired-monochrome nil))

  (use-package dired-open
    :commands (dired dired-jump)
    :config
    ;; Doesn't work as expected!
    ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
    (setq dired-open-extensions '(("png" . "feh")
                                  ("mkv" . "mpv"))))

#+end_src

* Treemacs
#+begin_src emacs-lisp
  (use-package treemacs)
  (use-package lsp-treemacs
    :after lsp)
  (use-package treemacs-evil
    :after (treemacs evil)
    :straight t)

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :straight t)

  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once)
    :straight t)
  (add-hook 'dired-mode-hook 'treemacs-icons-dired-mode)
  (use-package treemacs-magit
    :after (treemacs magit)
    :straight t)
#+end_src

* Org
** Modos de Org
#+begin_src emacs-lisp
(defun angl/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))
#+end_src

** Paquete Org
#+begin_src emacs-lisp
  (use-package org
    :hook (org-mode . angl/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time) ;; TODO Maybe change it to "note" to add thoughts on stuff in uni
    (setq org-log-into-drawer t)
    (setq org-agenda-files
          '("~/Org/Tasks.org"
            "~/Org/Cumpleaños.org"
            "~/Org/Habitos.org"))
    org-hide-emphasis-markers t)
#+end_src

** Org TOC
#+begin_src emacs-lisp
  (use-package toc-org)
  (if (require 'toc-org nil t)
      (progn
        (add-hook 'org-mode-hook 'toc-org-mode))
    (warn "toc-org not found"))
#+end_src

** Org Modern
#+begin_src emacs-lisp
  (use-package org-modern)

  (global-org-modern-mode)
  (setq org-modern-star '("✢" "✿" "❁" "✾" "❀" "✤" "❖"))
#+end_src
** Org Fancy Priorities
#+begin_src emacs-lisp
(use-package org-fancy-priorities
  :ensure t
  :hook
  (org-mode . org-fancy-priorities-mode)
  :config
  (setq org-fancy-priorities-list '("⚠" "‼" "❗")))
#+end_src
** Atajos de Bloque
#+begin_src emacs-lisp
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("s" . "src"))
#+end_src
** Agenda TODOs
#+begin_src emacs-lisp
    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)
  (setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
        (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

  (setq org-refile-targets
        '(("Archive.org" :maxlevel . 1)
          ("Tasks.org" :maxlevel . 1)))
  ;; Save Org files after refiling
  (advice-add 'org-refile :after 'org-save-all-org-buffers)
#+end_src
** Org Hábitos
#+begin_src emacs-lisp
  ;; MAYBE ADD LATER CAPTURE TEMPLATES
  ;; Configure custom agenda views TODO Traducir todo esto al español
    (setq org-agenda-custom-commands
     '(("d" "Tablero"
       ((agenda "" ((org-deadline-warning-days 7)))
        (todo "NEXT"
          ((org-agenda-overriding-header "Next Tasks")))
        (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

      ("n" "Next Tasks"
       ((todo "NEXT"
          ((org-agenda-overriding-header "Next Tasks")))))

      ("W" "Work Tasks" tags-todo "+work-email")

      ;; Low-effort next actions
      ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
       ((org-agenda-overriding-header "Low Effort Tasks")
        (org-agenda-max-todos 20)
        (org-agenda-files org-agenda-files)))

      ("w" "Workflow Status"
       ((todo "WAIT"
              ((org-agenda-overriding-header "Waiting on External")
               (org-agenda-files org-agenda-files)))
        (todo "REVIEW"
              ((org-agenda-overriding-header "In Review")
               (org-agenda-files org-agenda-files)))
        (todo "PLAN"
              ((org-agenda-overriding-header "In Planning")
               (org-agenda-todo-list-sublevels nil)
               (org-agenda-files org-agenda-files)))
        (todo "BACKLOG"
              ((org-agenda-overriding-header "Project Backlog")
               (org-agenda-todo-list-sublevels nil)
               (org-agenda-files org-agenda-files)))
        (todo "READY"
              ((org-agenda-overriding-header "Ready for Work")
               (org-agenda-files org-agenda-files)))
        (todo "ACTIVE"
              ((org-agenda-overriding-header "Active Projects")
               (org-agenda-files org-agenda-files)))
        (todo "COMPLETED"
              ((org-agenda-overriding-header "Completed Projects")
               (org-agenda-files org-agenda-files)))
        (todo "CANC"
              ((org-agenda-overriding-header "Cancelled Projects")
               (org-agenda-files org-agenda-files)))))))
#+end_src
** Org Notas Rápidas
#+begin_src emacs-lisp
  (setq org-capture-templates
      `(("t" "Tareas / Projectos")
        ("tt" "Tarea" entry (file+olp "~/Org/Tasks.org" "Transitorias")
             "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

        ("j" "Entradas de Diario")
        ("jj" "Diario" entry
             (file+olp+datetree "~/Org/Diario.org")
             "\n* %<%I:%M %p> - Diario :journal:\n\n%?\n\n"
             ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
             :clock-in :clock-resume
             :empty-lines 1)
        ("jm" "Reuniones" entry
             (file+olp+datetree "~/Org/Diario.org")
             "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
             :clock-in :clock-resume
             :empty-lines 1)

        ("w" "Flujo Laboral")
        ("we" "Revisando Email" entry (file+olp+datetree "~/Org/Diario.org")
             "* Revisando Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

        ("m" "Captura de Matricas")
        ("mw" "Peso" table-line (file+headline "~/Org/Metricas.org" "Weight")
         "| %U | %^{Peso} | %^{Notas} |" :kill-buffer t)))
#+end_src
