README.org
** Org Ajustes Visuales
#+begin_src emacs-lisp
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("✢" "✿" "❁" "✾" "❀" "✤" "❖")))

    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  (with-eval-after-load 'org-faces
  (set-face-attribute 'org-document-title nil :font "Iosevka Comfy Duo" :weight 'bold :height 1.3)
  (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Iosevka Comfy Duo" :weight 'regular :height (cdr face))))

  (defun angl/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . angl/org-mode-visual-fill))
#+end_src

** Org Babel Tangle
#+begin_src emacs-lisp
  (defun efs/org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name user-emacs-directory))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src

* Corfu
Sistema de autocompletacion moderna con integración para LSP y Ivy.
#+begin_src emacs-lisp
  (use-package corfu
    :custom
    (corfu-cycle t)
    (corfu-auto t)
    (corfu-auto-prefix 2)
    (corfu-auto-delay 0.0)
    (corfu-quit-at-boundary 'separator)
    (corfu-echo-documentation 0.25)
    (corfu-preview-current 'insert)
    (corfu-preselect-first nil)
    :bind (:map corfu-map
                ;;("M-SCP"   . corfu-insert-separator)
                ("RET"     . nil)
                ("TAB"     . corfu-next)
                ([tab]     . corfu-next)
                ("S-TAB"   . corfu-previous)
                ([backtab] . corfu-previous)
                ("S-<return>" . corfu-insert))
    :init
    (global-corfu-mode)
    (corfu-popupinfo-mode)
    (corfu-history-mode)
    :config
    (add-hook 'eshell-mode-hook
              (lambda () (setq-local corfu-quit-at-boundary t
                                     corfu-quit-no-match t
                                     corfu-auto nil)
                (corfu-mode))))

  (setq corfu-popupinfo-delay (cons t 0.0))
#+end_src

* Servidores de Lenguajes & Lista de Sugestiones
** Orderless
Se integra con lsp-mode y Corfu para expandir sus habilidades de sugerencias.
#+begin_src emacs-lisp
  (use-package orderless
    :init
    ;; Tune the global completion style settings to your liking!
    ;; This affects the minibuffer and non-lsp completion at point.
    (setq completion-styles '(orderless partial-completion basic)
          completion-category-defaults nil
          completion-category-overrides nil))
#+end_src

** LSP-Mode
Permite usar LSP en Emacs, pero por si no hace nada. Actualmente configurado para usar Corfu y orderless para autocompletamiento.

TODO: Añadir mejoras con cape.el y orderless
#+begin_src emacs-lisp
      (use-package lsp-mode
         :custom
         (lsp-completion-provider :none)
         :commands (lsp lsp-deferred)
         :init
         (defun angl/lsp-mode-setup-completion ()
           (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
                 '(orderless)))
         (setq lsp-keymap-prefix "C-c l") ;; Puede ser "C-l" ó "s-l"
         :hook
         (lsp-completion-mode . angl/lsp-mode-setup-completion)
         :config
         (lsp-enable-which-key-integration t))
#+end_src

** Yasnippet
Requerido por LSP.
#+begin_src emacs-lisp
        (use-package yasnippet
          :straight t
          :bind
          ("C-c y s" . yas-insert-snippet)
          ("C-c y v" . yas-visit-snippet-file)
          :config
          (add-to-list 'yas-snippet-dirs "~/.emacs.d/snippets")
          (yas-global-mode 1))

#+end_src

** Mejoras de Rendimiento para LSP
Dos configuraciones que mejoran el rendimiento de LSP en Emacs.
#+begin_src emacs-lisp
         (setq read-process-output-max (* 1024 1024)) ;; 1mb
         (setq gc-cons-threshold 100000000)
#+end_src

* Lenguages
** Typescript
#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))
#+end_src

** Python
#+begin_src emacs-lisp
(use-package lsp-pyright
  :straight t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp-deferred))))  ; or lsp-deferred
#+end_src

* Atajos
#+begin_src emacs-lisp
  (angl/leader-keys
    ;; Acciones en Org
    "o" '(:ignore t :which-key "Acciones en Org")
    "oA" '(org-agenda :which-key "Abrir Agenda")
    "ot" '(counsel-org-tag :which-key "Añadir Etiquetas")
    "oc" '(org-capture :which-key "Notas Rapidas")
    ;; Herramientas de Escritura     
    "w" '(:ignore t :which-key "Herramientas de Escritura")
    "wr" '(writeroom-mode :which-key "Alternar Modo de Escritura"))
#+end_src
